In [35]:
!pip install -q git+https://github.com/tensorflow/docs
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

try:
  # %tensorflow_version only exists in Colab.
  %tensorflow_version 2.x
except Exception:
  pass
import tensorflow as tf

from tensorflow import keras
from tensorflow.keras import layers

import tensorflow_docs as tfdocs
import tensorflow_docs.plots
import tensorflow_docs.modeling

[notice] A new release of pip available: 22.3.1 -> 23.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [36]:
!wget https://cdn.freecodecamp.org/project-data/health-costs/insurance.csv
dataset = pd.read_csv('insurance.csv')
dataset.tail()

'wget' is not recognized as an internal or external command,
operable program or batch file.

      age     sex   bmi  children smoker     region  expenses
1333   50    male  31.0         3     no  northwest  10600.55
1334   18  female  31.9         0     no  northeast   2205.98
1335   18  female  36.9         0     no  southeast   1629.83
1336   21  female  25.8         0     no  southwest   2007.95
1337   61  female  29.1         0    yes  northwest  29141.36

In [37]:
dataset.shape

(1338, 7)

In [38]:
dataset.head()

   age     sex   bmi  children smoker     region  expenses
0   19  female  27.9         0    yes  southwest  16884.92
1   18    male  33.8         1     no  southeast   1725.55
2   28    male  33.0         3     no  southeast   4449.46
3   33    male  22.7         0     no  northwest  21984.47
4   32    male  28.9         0     no  northwest   3866.86

In [39]:
dataset["sex"]=dataset["sex"].apply(lambda x : 0 if x=="male" else 1)
dataset["smoker"]=dataset["smoker"].apply(lambda x : 1 if x=="yes" else 0)

In [40]:
dataset.head()

   age  sex   bmi  children  smoker     region  expenses
0   19    1  27.9         0       1  southwest  16884.92
1   18    0  33.8         1       0  southeast   1725.55
2   28    0  33.0         3       0  southeast   4449.46
3   33    0  22.7         0       0  northwest  21984.47
4   32    0  28.9         0       0  northwest   3866.86

In [41]:
df=pd.get_dummies(dataset, columns=["region"])

In [42]:
df.head()

,age,sex,bmi,children,smoker,expenses,region_northeast,region_northwest,region_southeast,region_southwest
0,19,1,27.9,0,1,16884.92,0,0,0,1
1,18,0,33.8,1,0,1725.55,0,0,1,0
2,28,0,33.0,3,0,4449.46,0,0,1,0
3,33,0,22.7,0,0,21984.47,0,1,0,0
4,32,0,28.9,0,0,3866.86,0,1,0,0

In [43]:
df.isnull().sum()

age                 0
sex                 0
bmi                 0
children            0
smoker              0
expenses            0
region_northeast    0
region_northwest    0
region_southeast    0
region_southwest    0
dtype: int64

In [44]:
y=df['expenses'].values
x=df.drop(columns=["expenses"]).values

In [48]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test=train_test_split(x,y,test_size=0.2, random_state=0)

In [45]:
INPUT_SIZE=x.shape[1]

In [46]:
model=tf.keras.Sequential([
    tf.keras.layers.Dense(units=15, input_shape=(INPUT_SIZE, ), activation="relu"),
    tf.keras.layers.Dense(units=30, activation="relu"),
    tf.keras.layers.Dense(units=1, )
])